_protected/views/student-in-course/_form.php


    <?php $form = ActiveForm::begin(); ?>

    <?= $form->field($model, 'student_id')->dropDownList(ArrayHelper::map(Student::find()->all(),'id','name'),['prompt' => 'Select a student']) ?>

    <?= $form->field($model, 'course_id')->dropDownList(ArrayHelper::map(Course::find()->all(),'id','name'),['prompt' => 'Select a course']) ?>
---
SELECT * FROM `student`
SELECT * FROM `course`