_protected/controllers/StudentInCourseController.php

    public function actionCreate()
    {
        $model = new StudentInCourse();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `student_in_course` (`student_id`, `course_id`) VALUES (5, 1)

    protected function findModel($student_id, $course_id)
    {
        if (($model = StudentInCourse::findOne(['student_id' => $student_id, 'course_id' => $course_id])) !== null) {
---
SELECT * FROM `student_in_course` WHERE (`student_id`='5') AND (`course_id`='2')