_protected/controllers/StudentController.php

SELECT * FROM `student` WHERE `id`='5'
---
    protected function findModel($id)
    {
        if (($model = Student::findOne($id)) !== null) {