_protected/rbac/models/AuthItem.php

    public static function getRoles()
    {
        // if user is not 'owner' , we do not want to show him users with that role
        if (!Yii::$app->user->can('owner')) {
            return static::find()->select('name')->where(['type' => 1])->andWhere(['!=', 'name', 'owner'])->all();
        }

        // this is You or some other super admin, so show everything
        return static::find()->select('name')->where(['type' => 1])->all();
---
SELECT `name` FROM `auth_item` WHERE `type`=1